## Plan Result (netbox_ptlsbox)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 8 to add, 1 to change, 1 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.POSTGRES-DATABASE
  * azurerm_key_vault_secret.POSTGRES-HOST
  * azurerm_key_vault_secret.POSTGRES-PASS
  * azurerm_key_vault_secret.POSTGRES-USER
  * azurerm_key_vault_secret.redis_accesskey
  * azurerm_key_vault_secret.redis_hostname
  * azurerm_key_vault_secret.redis_port
  * module.postgresql_flexible.azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;azure.extensions&#34;]
* Update
  * module.redis.azurerm_redis_cache.redis
* Delete
  * module.postgresql_flexible.azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;backslash_quote&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.POSTGRES-DATABASE will be created
  + resource "azurerm_key_vault_secret" "POSTGRES-DATABASE" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/64b1c6d6-1481-44ad-b620-d8fe26a2c768/resourceGroups/netbox-ptlsbox-rg/providers/Microsoft.KeyVault/vaults/netbox-vault-ptlsbox"
      + name                    = "netbox-POSTGRES-DATABASE-v14"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES-HOST will be created
  + resource "azurerm_key_vault_secret" "POSTGRES-HOST" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/64b1c6d6-1481-44ad-b620-d8fe26a2c768/resourceGroups/netbox-ptlsbox-rg/providers/Microsoft.KeyVault/vaults/netbox-vault-ptlsbox"
      + name                    = "netbox-POSTGRES-HOST-v14"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES-PASS will be created
  + resource "azurerm_key_vault_secret" "POSTGRES-PASS" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/64b1c6d6-1481-44ad-b620-d8fe26a2c768/resourceGroups/netbox-ptlsbox-rg/providers/Microsoft.KeyVault/vaults/netbox-vault-ptlsbox"
      + name                    = "netbox-POSTGRES-PASS-v14"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES-USER will be created
  + resource "azurerm_key_vault_secret" "POSTGRES-USER" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/64b1c6d6-1481-44ad-b620-d8fe26a2c768/resourceGroups/netbox-ptlsbox-rg/providers/Microsoft.KeyVault/vaults/netbox-vault-ptlsbox"
      + name                    = "netbox-POSTGRES-USER-v14"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.redis_accesskey will be created
  + resource "azurerm_key_vault_secret" "redis_accesskey" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/64b1c6d6-1481-44ad-b620-d8fe26a2c768/resourceGroups/netbox-ptlsbox-rg/providers/Microsoft.KeyVault/vaults/netbox-vault-ptlsbox"
      + name                    = "netbox-redis-accesskey"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.redis_hostname will be created
  + resource "azurerm_key_vault_secret" "redis_hostname" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/64b1c6d6-1481-44ad-b620-d8fe26a2c768/resourceGroups/netbox-ptlsbox-rg/providers/Microsoft.KeyVault/vaults/netbox-vault-ptlsbox"
      + name                    = "netbox-redis-hostname"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.redis_port will be created
  + resource "azurerm_key_vault_secret" "redis_port" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/64b1c6d6-1481-44ad-b620-d8fe26a2c768/resourceGroups/netbox-ptlsbox-rg/providers/Microsoft.KeyVault/vaults/netbox-vault-ptlsbox"
      + name                    = "netbox-redis-port"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.postgresql_flexible.azurerm_postgresql_flexible_server_configuration.pgsql_server_config["azure.extensions"] will be created
  + resource "azurerm_postgresql_flexible_server_configuration" "pgsql_server_config" {
      + id        = (known after apply)
      + name      = "azure.extensions"
      + server_id = "/subscriptions/64b1c6d6-1481-44ad-b620-d8fe26a2c768/resourceGroups/netbox-ptlsbox-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/netbox-v14-flexible-ptlsbox"
      + value     = "PG_BUFFERCACHE,PG_STAT_STATEMENTS,PLPGSQL"
    }

  # module.postgresql_flexible.azurerm_postgresql_flexible_server_configuration.pgsql_server_config["backslash_quote"] will be destroyed
  # (because key ["backslash_quote"] is not in for_each map)
  - resource "azurerm_postgresql_flexible_server_configuration" "pgsql_server_config" {
      - id        = "/subscriptions/64b1c6d6-1481-44ad-b620-d8fe26a2c768/resourceGroups/netbox-ptlsbox-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/netbox-v14-flexible-ptlsbox/configurations/backslash_quote" -> null
      - name      = "backslash_quote" -> null
      - server_id = "/subscriptions/64b1c6d6-1481-44ad-b620-d8fe26a2c768/resourceGroups/netbox-ptlsbox-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/netbox-v14-flexible-ptlsbox" -> null
      - value     = "on" -> null
    }

  # module.redis.azurerm_redis_cache.redis will be updated in-place
  ~ resource "azurerm_redis_cache" "redis" {
        id                            = "/subscriptions/64b1c6d6-1481-44ad-b620-d8fe26a2c768/resourceGroups/netbox-ptlsbox-rg/providers/Microsoft.Cache/redis/netbox-ptlsbox"
        name                          = "netbox-ptlsbox"
        tags                          = {
            "application"  = "core"
            "builtFrom"    = "hmcts/rdo-netbox"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (21 unchanged attributes hidden)

      ~ redis_configuration {
          ~ maxmemory_delta                 = 125 -> 642
          ~ maxmemory_reserved              = 125 -> 642
            # (8 unchanged attributes hidden)
        }
    }

Plan: 8 to add, 1 to change, 1 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":32,"Program":"tfcmt","SHA1":"","Target":"netbox_ptlsbox","Vars":{}} -->